app/controllers/accounts_controller.rb

  def create
    current_user_session.destroy if current_user_session

    @user = User.new(params[:account])
    @user.activated_at = Time.now
    @user.password = Authlogic::CryptoProviders::Sha1.encrypt(Time.now.to_s + (1..10).collect{ rand.to_s }.join)[1..7] if @user.password.blank?
    @user.password_confirmation = @user.password

    if @user.save
      #@user.deliver_activation_instructions!
      @user_session = UserSession.create @user

      flash[:notice] = I18n.t('notice.account_registered')

      if params[:form]
        @form = @user.forms.first
        @form.assign params[:form]
        @form.save!
---
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "activated_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES('Bt2hy4jcbRNxhQDl4fva', NULL, '2009-04-11 18:23:38', NULL, 'c361a907d5eaf3c668c8750c7b8f898e8314cbf8e14c536f009e9e6040c194f3fcf1cc44f55b9055ad991eef14b5bfbf08d699d0acccbc1fb78fb59af85e4b59', 'WVklZ_OU9yrhWOrhlq5L', '2009-04-11 18:23:38', 0, NULL, 'IuG1_7-RdIRlhgp76gHv', NULL, '3d0568913964e69e2dbee3b0d33c0412cd2181f779114734b4a660a56a2fa1b0497a6bcdf0aa3c2810b354e75ba139855315ca62e129e47a54cf42c621908e21', 0, NULL, NULL, 'my@mail.ru')
SELECT * FROM "forms" WHERE ("forms".user_id = 1)
INSERT INTO "forms" ("created_at", "title", "updated_at", "fields", "user_id", "description") VALUES('2009-04-11 18:23:38', 'Контактная форма', '2009-04-11 18:23:38', '---
UPDATE "users" SET "updated_at" = '2009-04-11 18:28:28', "perishable_token" = 'hPoC1hYgweZNFo8XuU3a', "last_request_at" = '2009-04-11 18:28:28' WHERE "id" = 1

  def update
    @user = @current_user

    if @user.update_attributes(params[:account])
---
UPDATE "users" SET "login_count" = 3, "persistence_token" = '1168b7ba491f006879b0f3588ed1cec5babfd614f07632587d3c96c9448529d36640f9eafbe7fdf7878d0b4174e592c866fc5c1ad95590e5d9fe659b839f3965', "updated_at" = '2009-04-11 21:00:10', "perishable_token" = 'db144TVG0DucovcubS36', "last_request_at" = '2009-04-11 21:00:10', "last_login_at" = '2009-04-11 21:00:09', "current_login_at" = '2009-04-11 21:00:10', "password_salt" = 'Qqdz5d9AoAMsoY9XvZ2L', "crypted_password" = 'a621da7ab7bc3e99ef31ad83e8f910ee604440befa7c49f2e3b657eff2108e3582e3736727820c3b0e90ba8aa7854b106e2eca8d4379a122383f54dca327c81b' WHERE "id" = 1