app/controllers/account_activations_controller.rb

  def show
    unless @user.activated_at
      @user.activated_at = Time.now
      @user.save
    end

    @user_session = UserSession.new( @user )

    if @user_session.save
      flash[:notice] = I18n.t('notice.account_activated')
      redirect_to form_url( @user.forms.first )
---
UPDATE "users" SET "login_count" = 1, "current_login_ip" = '127.0.0.1', "updated_at" = '2009-04-01 18:29:28', "perishable_token" = 'oY7Zc1cR9JqWhrRq9lP4', "last_request_at" = '2009-04-01 18:29:28', "current_login_at" = '2009-04-01 18:29:28' WHERE "id" = 7
SELECT * FROM "forms" WHERE ("forms".user_id = 6) LIMIT 1