app/controllers/account_passwords_controller.rb

  def create
    @user = User.find_by_email(params[:account_password][:email])
---
SELECT * FROM "users" WHERE ("users"."email" = 'test@mail.ru') LIMIT 1

  def update
    @user.password = params[:account_password][:password]
    @user.password_confirmation = params[:account_password][:password_confirmation]
    @user.activated_at = Time.now unless @user.activated_at

    if @user.save
---
UPDATE "users" SET "login_count" = 2, "persistence_token" = '89528854256453afda9ca9d9d7adb8e6dfcd300e0ca4d46c769702384b465809360e999ef180ad5e5f0f36f95d787ed0469caacc6305fd02e698c66bd0ff9ffc', "updated_at" = '2009-04-11 11:08:11', "perishable_token" = 'cOqFIeox1ab02yfW2IJf', "last_request_at" = '2009-04-11 11:08:11', "last_login_at" = '2009-04-11 11:08:10', "last_login_ip" = '127.0.0.1', "current_login_at" = '2009-04-11 11:08:11', "password_salt" = 'u3F1ennP-Wnd-T_5cefx', "crypted_password" = '22a2f9181dce0bdf745a41a2c80dda0e9de5f496d31180d67fe35ded760eabc2cef98d16f8363580b992c6dffc7652466a5ed8f6413f1c064f7a1f4f5ed39cae' WHERE "id" = 1