app/controllers/forms_controller.rb

SELECT * FROM "forms" WHERE ("forms"."id" = 9)
---
  def code
    @form = Form.find params[:id]

UPDATE "forms" SET "updated_at" = '2009-04-10 09:12:49', "fields" = '---
---
  def update
    @form.assign params[:form]

    if @form.save

SELECT * FROM "forms" WHERE ("forms"."id" = 9 AND ("forms".user_id = 9))
---
  def load_user_form
    @form = current_user.forms.find params[:id]