app/controllers/messages_controller.rb

SELECT * FROM "messages" WHERE ("messages".user_id = 1) ORDER BY created_at DESC
---
  def index
    @messages = current_user.messages.find(:all,:order => 'created_at DESC')

SELECT * FROM "messages" WHERE ("messages".user_id = 1) AND ((read_at IS NULL) AND ("messages".user_id = 1)) ORDER BY created_at DESC
---
  def unread
    @messages = current_user.messages.unread.find(:all,:order => 'created_at DESC')

SELECT * FROM "messages" WHERE ("messages"."id" = 6 AND ("messages".user_id = 1))
UPDATE "messages" SET "updated_at" = '2009-03-22 19:11:42', "read_at" = '2009-03-22 19:11:42' WHERE "id" = 1
UPDATE "users" SET "updated_at" = '2009-03-30 20:45:15', "perishable_token" = 'SFGqunq-Buo-Q0jIlEME', "last_request_at" = '2009-03-30 20:45:15' WHERE "id" = 2
---
  def show
    @message = current_user.messages.find(params[:id])

    unless @message.read_at # Отмечаем сообщение, как прочитанное
       @message.read_at = Time.now
       @message.save!

SELECT * FROM "messages" WHERE ("messages"."id" = 2 AND ("messages".user_id = 1))
DELETE FROM "messages" WHERE "id" = 1
---
  def destroy
    @message = current_user.messages.find(params[:id])
    @message.destroy

INSERT INTO "messages" ("sender_email", "created_at", "title", "token", "updated_at", "user_id", "parent_id", "content", "status", "sender_name") VALUES('dwsad@ddd.ru', '2009-03-21 13:09:19', 'ddwsa', '38ae99ce567448b28713ffbbcaf5eddeb5281daca974e393c528ac4112af143404f5b1554db1b055876a34c4fd5b4817aeb6667d50edc2830a21f1124b68e3ac', '2009-03-21 13:09:19', 0, NULL, 'ddcsaxz', NULL, 'ddesa')
---
  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save