app/controllers/root_controller.rb

  def post
    @form = Form.find(params[:form_id]) # Форма, в которую постится собщение

    @message = Message.new
    @message.form = @form
    @message.user = @form.user
    @message.sender_name = params[:sender_name]
    @message.sender_email = params[:sender_email]
    @message.data = []

    @form.fields.each_with_index do |field,i|
      @message.data << field.enabled? ? params[:fields][i.to_s.to_sym] : nil
---
SELECT * FROM "forms" WHERE ("forms"."id" = 2)
INSERT INTO "messages" ("sender_email", "form_id", "created_at", "title", "token", "updated_at", "user_id", "read_at", "parent_id", "content", "sender_name") VALUES('fedsxce@mail.ru', 2, '2009-03-30 20:07:15', 'fedscx', 'ea7d53ad540026d87e64fc24ccdb922bfc33dc2f', '2009-03-30 20:07:15', 2, NULL, NULL, 'efsazx', 'fffffff')

  def status
    @message = Message.find_by_token(params[:token])
---
SELECT * FROM "messages" WHERE ("messages"."token" = '4281a64ca4591db199aec3b6fe4a2145d0e76f5a') LIMIT 1