app/controllers/users_controller.rb

INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES('0hOXpfXgnvLQ6dtbzyaI', NULL, '2009-03-21 12:53:34', '2337b7f8f6b69f8a0110a7c860aa4dbff781be278c2b79868900a4e77be003a5760c35067e8cd7bc04c22e673774397ae1229b3e6159afc85e10d0ba7cf293bd', '2xL5bXeW4YDccpycN0nz', '2009-03-21 12:53:34', 0, NULL, 'e2ca54400e5d090c5850b4e2914efea2b8cbee44b8ef023f10e2269d7a18291e542bdff0d94bbaf38987a728980cd2f344f0cfc3adfc999c3002cd1b93dbae28', NULL, 'fd125767e7fa6728ff6219ee017257fa3d2ed0c14e33998ccaaa1152c93599cdd8f98a182e774654d07d845c5b6375f513ac3eb7302b863dc8503c625a6a4e84', 0, NULL, NULL, 'qwertyu@mail.ru')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "login_count" = 3, "persistence_token" = '478b92bc88046a8bd030a11dba2d651ff3d773be305583974c6aad9eafd52a2de983da501d27b171eaebe5cd582355c98860cd17f83bff4e7474a063fd54e118', "updated_at" = '2009-04-11 18:00:15', "perishable_token" = 'd8MWc0LSQyNE7Iflloit', "last_request_at" = '2009-04-11 18:00:15', "current_login_at" = '2009-04-11 18:00:15', "password_salt" = 'NxqnPwE8WTZxe45q6qqI', "crypted_password" = '683d8ab449a810ad5de0341320149334888d708aa0062fc104e4058da15b11d312a7afaf5c2c490f3a7954126c92ce7a4e79d8f0e2652cb08d2fb461f9b3aff9' WHERE "id" = 1
---
  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])